Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/Microchip.PIC32CZ-CA80_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
         schemaVersion="1.3"
         xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd"
         xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Microchip</vendor>
   <url>https://packs.download.microchip.com/</url>
   <name>PIC32CZ-CA80_DFP</name>
   <description>Microchip PIC32CZ-CA80 Series Device Support</description>
   <releases>
      <release version="1.2.150" date="2023-05-23">
        - Fixed missing TCC_ prefix in the value groups.
      </release>
      <release version="1.1.123" date="2023-03-20">
        - Updated SVD files to contain version 1.3 information.
        - Added bitfields to AC.WINCTRL.
        - Updated USB PHY registers.
        - Added temperature calibration fuse values.
        - Updated value-groups for TCC.
      </release>
      <release version="1.0.17" date="2022-09-09">
        - Initial release.
        - Headers minor version increased to v2.1.0.
        - Changed integer constant literal macros from _Ux_ to _UNITxx_ (where xx is 32, 16 or 8) (MISRA C2012:R12.2).
      </release>
   </releases>
   <keywords>
      <keyword>Microchip</keyword>
      <keyword>Device Family Package Microchip</keyword>
      <keyword>Device Support</keyword>
      <keyword>PIC32CZ-CA80</keyword>
   </keywords>
   <devices>
      <family Dfamily="PIC32CZ-CA80" Dvendor="Microchip:3">
         <environment name="microchip">
            <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                            schemaVersion="1.0">
               <mchp:prerequisite component="MPLAB X IDE" version="[5.10-"/>
               <mchp:prerequisite component="MPLAB X IPE" version="[5.10-"/>
            </mchp:extension>
         </environment>
         <device Dname="PIC32CZ2051CA80100">
            <processor Dcore="Cortex-M7"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="DP_FPU"/>
            <compile header="CA80/include/pic32c.h" define="__PIC32CZ2051CA80100__"/>
            <memory id="IROM1" start="0x4000000" size="0x8000"/>
            <memory id="IROM2"
                    start="0x8000000"
                    size="0x20000"
                    default="1"
                    startup="1"/>
            <memory id="IROM3" start="0xA000000" size="0x1000"/>
            <memory id="IROM4" start="0xA002000" size="0x1000"/>
            <memory id="IROM5" start="0xA004000" size="0x1000"/>
            <memory id="IROM6" start="0xA008000" size="0x1000"/>
            <memory id="IROM7" start="0xA00A000" size="0x1000"/>
            <memory id="IROM8" start="0xC000000" size="0x200000"/>
            <memory id="IRAM1" start="0x00000000" size="0x20000" default="1"/>
            <memory id="IRAM2" start="0x20000000" size="0x20000"/>
            <memory id="IRAM3" start="0x20020000" size="0x80000"/>
            <memory id="IRAM4" start="0x80000000" size="0x10000000"/>
            <memory id="IRAM5" start="0x90000000" size="0x10000000"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="CA80/atdf/PIC32CZ2051CA80100.atdf"/>
                  <at:variant ordercode="PIC32CZ2051CA80100-I/BAD"
                              vccmin="1.66"
                              vccmax="3.66"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="PIC32CZ2051CA80100-V/BAD"
                              vccmin="1.66"
                              vccmax="3.66"
                              tempmin="-40"
                              tempmax="105"/>
                  <at:variant ordercode="PIC32CZ2051CA80100-E/BAD"
                              vccmin="1.66"
                              vccmax="3.66"
                              tempmin="-40"
                              tempmax="125"/>
                  <at:variant ordercode="PIC32CZ2051CA80100-I/7YX"
                              vccmin="1.66"
                              vccmax="3.66"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="PIC32CZ2051CA80100-V/7YX"
                              vccmin="1.66"
                              vccmax="3.66"
                              tempmin="-40"
                              tempmax="105"/>
                  <at:variant ordercode="PIC32CZ2051CA80100-E/7YX"
                              vccmin="1.66"
                              vccmax="3.66"
                              tempmin="-40"
                              tempmax="125"/>
                  <at:memory name="ITCM"
                             start="0x00000000"
                             size="0x20000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="PRM_ROM"
                             start="0x4000000"
                             size="0x8000"
                             type="rom"
                             rw="R"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="FCR_BFM"
                             start="0x8000000"
                             size="0x20000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_USERCFG1"
                             start="0xA000000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_USEROTP1"
                             start="0xA001000"
                             size="0x1000"
                             type="user_signatures"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_BOOTCFG1"
                             start="0xA002000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_DALCFG"
                             start="0xA004000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_CALOTP"
                             start="0xA007000"
                             size="0x1000"
                             type="other"
                             pagesize="4096"
                             rw="R"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_USERCFG2"
                             start="0xA008000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_USEROTP2"
                             start="0xA009000"
                             size="0x1000"
                             type="user_signatures"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_CFM_BOOTCFG2"
                             start="0xA00A000"
                             size="0x1000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="FCR_PFM"
                             start="0xC000000"
                             size="0x200000"
                             type="flash"
                             pagesize="4096"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="DTCM"
                             start="0x20000000"
                             size="0x20000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="FLEXRAM"
                             start="0x20020000"
                             size="0x80000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="APBA"
                             start="0x44000000"
                             size="0x800000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="APBB"
                             start="0x44800000"
                             size="0x800000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="APBC"
                             start="0x45000000"
                             size="0x800000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="APBD"
                             start="0x45800000"
                             size="0x800000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="APBE"
                             start="0x46000000"
                             size="0x800000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="APBF"
                             start="0x46800000"
                             size="0x800000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="SQI0_SFR"
                             start="0x4F008000"
                             size="0x1000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="SQI1_SFR"
                             start="0x4F009000"
                             size="0x1000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="USBHS0_SFR"
                             start="0x4F010000"
                             size="0x2000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="USBHS1_SFR"
                             start="0x4F012000"
                             size="0x2000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="HSM_SFR"
                             start="0x4F018000"
                             size="0x400"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="SQI0_XIP"
                             start="0x80000000"
                             size="0x10000000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             external="true"
                             address-space="base"/>
                  <at:memory name="SQI1_XIP"
                             start="0x90000000"
                             size="0x10000000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             external="true"
                             address-space="base"/>
                  <at:memory name="PPB"
                             start="0xE0000000"
                             size="0x20000000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="CM7H_ROM_TABLE"
                             start="0xE00FE000"
                             size="0x100"
                             type="rom"
                             rw="R"
                             exec="true"
                             address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ice4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="CA80/edc/PIC32CZ2051CA80100.PIC"/>
                  <mchp:xc32 name="CA80/xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="CA80/hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="CA80/hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="CA80/hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="CA80/hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="CA80/hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="CA80/hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="CA80/hwtools/sdm/sdmICD5.xml"/>
                     <mchp:file name="CA80/hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="CA80/hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="CA80/hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="CA80/hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="CA80/hwtools/persfr/arm32.persfr"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32CZ2051CA80100"
                  title="Device page for PIC32CZ2051CA80100"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32CZ2051CA80100"
                  title="Datasheet"/>
         </device>
