Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/Microchip.PIC32CZ-CA80_DFP.pdsc
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="PIC32CZ4010CA80208">
         <description>Headers and startup code for Microchip PIC32CZ4010CA80208</description>
         <files>
            <file condition="C" category="include" name="CA80/include/"/>
            <file condition="C" category="header" name="CA80/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="CA80/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="CA80/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA80/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA80/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA80/gcc/gcc/startup_pic32cz4010ca80208.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA80/gcc/system_pic32cz4010ca80208.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="CA80/gcc/gcc/pic32cz4010ca80208_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="CA80/gcc/gcc/pic32cz4010ca80208_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA80/armcc/armcc/startup_pic32cz4010ca80208.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA80/armcc/system_pic32cz4010ca80208.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA80/iar/iar/startup_pic32cz4010ca80208.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA80/iar/system_pic32cz4010ca80208.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="CA80/iar/config/linker/Microchip/pic32cz4010ca80208/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="CA80/iar/config/linker/Microchip/pic32cz4010ca80208/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="PIC32CZ8110CA80100">
         <description>Headers and startup code for Microchip PIC32CZ8110CA80100</description>
         <files>
            <file condition="C" category="include" name="CA80/include/"/>
            <file condition="C" category="header" name="CA80/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="CA80/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="CA80/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA80/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA80/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA80/gcc/gcc/startup_pic32cz8110ca80100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA80/gcc/system_pic32cz8110ca80100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="CA80/gcc/gcc/pic32cz8110ca80100_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="CA80/gcc/gcc/pic32cz8110ca80100_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA80/armcc/armcc/startup_pic32cz8110ca80100.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA80/armcc/system_pic32cz8110ca80100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA80/iar/iar/startup_pic32cz8110ca80100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA80/iar/system_pic32cz8110ca80100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="CA80/iar/config/linker/Microchip/pic32cz8110ca80100/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="CA80/iar/config/linker/Microchip/pic32cz8110ca80100/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="PIC32CZ8110CA80144">
         <description>Headers and startup code for Microchip PIC32CZ8110CA80144</description>
         <files>
            <file condition="C" category="include" name="CA80/include/"/>
            <file condition="C" category="header" name="CA80/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="CA80/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="CA80/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA80/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA80/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA80/gcc/gcc/startup_pic32cz8110ca80144.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA80/gcc/system_pic32cz8110ca80144.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="CA80/gcc/gcc/pic32cz8110ca80144_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="CA80/gcc/gcc/pic32cz8110ca80144_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA80/armcc/armcc/startup_pic32cz8110ca80144.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA80/armcc/system_pic32cz8110ca80144.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA80/iar/iar/startup_pic32cz8110ca80144.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA80/iar/system_pic32cz8110ca80144.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="CA80/iar/config/linker/Microchip/pic32cz8110ca80144/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="CA80/iar/config/linker/Microchip/pic32cz8110ca80144/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="PIC32CZ8110CA80176">
         <description>Headers and startup code for Microchip PIC32CZ8110CA80176</description>
         <files>
            <file condition="C" category="include" name="CA80/include/"/>
            <file condition="C" category="header" name="CA80/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="CA80/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="CA80/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA80/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA80/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA80/gcc/gcc/startup_pic32cz8110ca80176.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA80/gcc/system_pic32cz8110ca80176.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="CA80/gcc/gcc/pic32cz8110ca80176_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="CA80/gcc/gcc/pic32cz8110ca80176_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA80/armcc/armcc/startup_pic32cz8110ca80176.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA80/armcc/system_pic32cz8110ca80176.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA80/iar/iar/startup_pic32cz8110ca80176.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA80/iar/system_pic32cz8110ca80176.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="CA80/iar/config/linker/Microchip/pic32cz8110ca80176/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="CA80/iar/config/linker/Microchip/pic32cz8110ca80176/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="PIC32CZ8110CA80208">
         <description>Headers and startup code for Microchip PIC32CZ8110CA80208</description>
         <files>
            <file condition="C" category="include" name="CA80/include/"/>
            <file condition="C" category="header" name="CA80/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="CA80/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="CA80/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA80/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="CA80/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA80/gcc/gcc/startup_pic32cz8110ca80208.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="CA80/gcc/system_pic32cz8110ca80208.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="CA80/gcc/gcc/pic32cz8110ca80208_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="CA80/gcc/gcc/pic32cz8110ca80208_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA80/armcc/armcc/startup_pic32cz8110ca80208.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="CA80/armcc/system_pic32cz8110ca80208.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA80/iar/iar/startup_pic32cz8110ca80208.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="CA80/iar/system_pic32cz8110ca80208.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="CA80/iar/config/linker/Microchip/pic32cz8110ca80208/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="CA80/iar/config/linker/Microchip/pic32cz8110ca80208/flash.icf"
                  attr="config"/>
         </files>
      </component>
   </components>
</package>
